"""
4. Артефакты

Кодерун спускается в Синтаксическую шахту, чтобы изучить тайны старого кода перед восхождением. Иногда в шахте попадаются артефакты — натуральные числа, которые имеют больше натуральных делителей, чем каждое из меньших натуральных чисел.

Нужно обработать q q запросов, каждый из которых характеризуется двумя целыми числами  l , r l,r. Для каждого запроса найдите количество артефактов на отрезке [ l ; r ] [l;r].
Формат ввода

В первой строке содержится единственное целое число q q ( 1 ≤ q ≤ 5 ⋅ 1 04 1≤q≤5⋅104) — количество запросов.

В последующих q q строках содержатся по два числа l , r l,r ( 1 ≤ l ≤ r ≤ 1 018 1≤l≤r≤1018) — границы отрезков.
Формат вывода

Для каждого запроса в отдельной строке выведите одно целое число — количество артефактов на отрезке [ l ; r ] [l;r].
Примечание

В первом запросе 1 1 является артефактом, поскольку имеет единственный натуральный делитель, и натуральных чисел меньше нет.

Во втором и третьем запросе единственным артефактом является число 6 6 с 4 4 делителями: 1 , 2 , 3 , 6 1,2,3,6. Можно показать, что других артефактов на отрезке нет. 8 8 не является артефактом, поскольку оно имеет только 4 4 натуральных делителя — столько же, сколько у числа 6 6.
"""

n = int(input())
ranges = [tuple(map(int, input().split())) for _ in range(n)]
artifacts = [(1, 1), (2, 2), (4, 3), (6, 4), (12, 6), (24, 8), (36, 9), (48, 10), (60, 12)]
for l, r in ranges:
    arts = 0
    max_divs = 0
    cur_art = 1
    for a in artifacts:
        if l <= a[0] <= r:
            arts += 1
            cur_art = a[0]
            max_divs = a[1]
        if a[0] > r:
            break
    for i in range(min(cur_art+12, l), r + 1):
        divisors = set()
        for j in range(1, int(i**0.5) + 1):
            if i % j == 0:
                divisors.add(j)
                divisors.add(i // j)

        if len(divisors) > max_divs:
            max_divs = len(divisors)
            artifacts.append((i,len(divisors)))
            if i >= l:
                arts+=1
    print(arts)
print(*artifacts, sep='\n')
